#+title: Emacs Configuration
#+property: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle init.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export
#+auto_tangle: yes

* Loading All Configuration Modules
#+name: emacs-modules
| Module Name            | Config Page                      |
|------------------------+----------------------------------|
| =basic-config.el=        | [[file:./basic-config.org][Basic Configuration]]              |
| =custom-elisp.el=        | [[file:./custom-elisp.org][Custom Elisp]]                     |
| =package-manager.el=     | [[file:./package-manager.org][Package Manager]]                  |
| =keybind-tools.el=       | [[file:keybinding-managers.org][Keybinding Tools]]                 |
| =applications.el=        | [[file:./packages/applications.org][Packages — Applications]]          |
| =autocompletion.el=      | [[file:./packages/autocompletion.org][Packages — Autocompletion]]        |
| =editing.el=             | [[file:./packages/editing.org][Packages — Editing]]               |
| =builtin.el=             | [[file:./packages/emacs-builtin.org][Packages — Emacs Built-ins]]       |
| =helpful.el=             | [[file:./packages/helpful.org][Packages — Making My Life Easier]] |
| =misc.el=                | [[file:./packages/misc.org][Packages — Misc]]                  |
| =org.el=                 | [[file:./packages/org.org][Packages — Org Mode]]              |
| =programming.el=         | [[file:./packages/programming.org][Packages — Programming]]           |
| =visuals.el=             | [[file:./packages/visual-config.org][Packages — Visuals]]               |
| =keybindings.el=         | [[file:./keybindings.org][Keybindings]]                      |

#+name: generate-modules
#+begin_src emacs-lisp :tangle no :cache yes :var modules=emacs-modules :exports none
(mapconcat (lambda (line)
             (concat "\"" (string-trim (car line) "=" "=") "\""))
           modules
           " ")
#+end_src

#+RESULTS[6fe38716345502d2f063250dea8da1431c30f6af]: generate-modules
: "basic-config.el" "custom-elisp.el" "package-manager.el" "keybind-tools.el" "applications.el" "autocompletion.el" "editing.el" "builtin.el" "helpful.el" "misc.el" "org.el" "programming.el" "visuals.el" "keybindings.el"

#+begin_src emacs-lisp :noweb yes
(dolist (module '(<<generate-modules()>>))
  (load (expand-file-name module user-emacs-directory)))
#+end_src
